import pandas as pd
import numpy as np

import pathlib


def load_obs_gts_file(
    file_path: pathlib.Path or str,
) -> pd.DataFrame:
    """
    加载 MUVOS 系统生成的 GTS 观测文件，文件内容如下所示：

    ```
    2020091900    09909
      174     32.18     34.83   1010.50     26.74     24.09    149.00      0.70      0.00      0.00 999999.00   1006.80
      180     32.01     34.88   1011.60     27.59     23.38    178.00      1.40      0.00      0.00 999999.00   1006.90
      412     32.98     35.57   1009.10     21.31     18.54    223.00      1.70      0.00      0.00 999999.00    980.30
      425     32.81     35.04   1010.60     27.50     24.28     26.00      1.60      0.00      0.00 999999.00   1010.00
      495     29.72     35.01   1008.60     30.52     13.25    342.00      7.10      0.00      0.00 999999.00    999.30
      502     33.13     35.80 999999.00     24.66      3.66    291.00      4.60      0.00      0.00 999999.00 999999.00
      503     33.02     35.57 999999.00     23.93     19.77 999999.00 999999.00      0.00      0.00 999999.00 999999.00
      506     32.96     35.33 999999.00     24.58      8.96 999999.00 999999.00      0.00      0.00 999999.00 999999.00
      507     32.98     35.09 999999.00     22.73     20.54    105.00      0.40      0.00      0.00 999999.00 999999.00
      511     32.85     35.11   1011.10     24.75     23.05    229.00      0.10      0.00      0.00 999999.00   1009.90
    ```

    Parameters
    ----------
    file_path: pathlib.Path or str
        文件路径

    Returns
    -------
    pandas.DataFrame:
        表格数据，其中缺测值被设置为 np.nan

    """
    with open(file_path, "r") as obs_file:
        obs_file.readline()
        df = pd.read_csv(
            obs_file,
            sep="\s+",
            names=[
                "station_id",
                "latitude",
                "longitude",
                "PRS_Sea",
                "TEM",
                "DPT",
                "WIN_D",
                "WIN_S",
                "PRE_1h",
                "PRE_6h",
                "PRE_24h",
                "PRS",
            ]
        )
        obs_file.close()
        df[df == 999999.0] = np.nan
    return df
